In [3]:
#Pandas
import pandas as pd
dict = {"Name":["Santhu","Kaur","Kiran","Suma","Punith","Priya"],
        "Marks":[64,75,86,97,94,67],
        "Gender":['M','F','M','F','M','F']
       }
#dataframe name
result = pd.DataFrame(dict)
result

     Name  Marks Gender
0  Santhu     64      M
1    Kaur     75      F
2   Kiran     86      M
3    Suma     97      F
4  Punith     94      M
5   Priya     67      F

In [4]:
#Display top 3 rows of the dataset
result.head(3)

     Name  Marks Gender
0  Santhu     64      M
1    Kaur     75      F
2   Kiran     86      M

In [5]:
result.head()

     Name  Marks Gender
0  Santhu     64      M
1    Kaur     75      F
2   Kiran     86      M
3    Suma     97      F
4  Punith     94      M

In [6]:
#Display lower rows of the dataset
result.tail()

     Name  Marks Gender
1    Kaur     75      F
2   Kiran     86      M
3    Suma     97      F
4  Punith     94      M
5   Priya     67      F

In [9]:
result.shape

(6, 3)

In [13]:
print("No.. of rows",result.shape[1],"\nNo.. of rows",result.shape[0])

No.. of rows 3
No.. of rows 6

In [14]:
#Inforamtion
result.info

<bound method DataFrame.info of      Name  Marks Gender
0  Santhu     64      M
1    Kaur     75      F
2   Kiran     86      M
3    Suma     97      F
4  Punith     94      M
5   Priya     67      F>

In [16]:
result.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Marks   6 non-null      int64
 2   Gender  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

In [17]:
#Find null values
result.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [18]:
#Describe
result.describe()

           Marks
count   6.000000
mean   80.500000
std    13.924798
min    64.000000
25%    69.000000
50%    80.500000
75%    92.000000
max    97.000000

In [20]:
#unique values
result["Marks"].unique()

array([64, 75, 86, 97, 94, 67])

In [21]:
result

     Name  Marks Gender
0  Santhu     64      M
1    Kaur     75      F
2   Kiran     86      M
3    Suma     97      F
4  Punith     94      M
5   Priya     67      F

In [23]:
#No.. of unique names
result["Name"].nunique()

6

In [25]:
#Count values of attribute
result["Gender"].value_counts()

Gender
M    3
F    3
Name: count, dtype: int64

In [34]:
#Find values B/w values
(result[(result["Marks"]>=60) & (result["Marks"]<=90)])

     Name  Marks Gender
0  Santhu     64      M
1    Kaur     75      F
2   Kiran     86      M
5   Priya     67      F

In [36]:
#Find length of values fetchlen
(result[(result["Marks"]>=30) & (result["Marks"]<=80)])

     Name  Marks Gender
0  Santhu     64      M
1    Kaur     75      F
5   Priya     67      F

In [38]:
result["Marks"].between(30,80)

0     True
1     True
2    False
3    False
4    False
5     True
Name: Marks, dtype: bool